tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "spicetify/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Display and control your Android device
brew "scrcpy"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Command-line tool to customize Spotify client
brew "spicetify/tap/spicetify-cli"
# Application launcher and productivity software
cask "alfred"
# App for recording the screen and installing apps in iOS and Android
cask "androidtool"
# Screenshot software
cask "flameshot"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Open-source code editor
cask "visual-studio-code"
mas "Foldor", id: 1559426624
mas "HP Smart", id: 1474276998
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
